In [10]:
import pandas as pd
import numpy as np

sayı1 = np.arange(0,10)
sayı2 = np.arange(10,20)

sayı3 = np.concatenate([sayı1,sayı2])
sayı4 = np.reshape(sayı3,(10,2))
df4 = pd.DataFrame(sayı4,columns=["s1","s2"])
df4

   s1  s2
0   0   1
1   2   3
2   4   5
3   6   7
4   8   9
5  10  11
6  12  13
7  14  15
8  16  17
9  18  19

In [11]:
df4[::2]

   s1  s2
0   0   1
2   4   5
4   8   9
6  12  13
8  16  17

In [12]:
df4[::2]["s1"]

0     0
2     4
4     8
6    12
8    16
Name: s1, dtype: int32